In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

The dataset was successfully loaded using Pandas. The dataset contains multiple columns representing passenger information. The first few rows show both numerical and categorical data.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

The dataset contains multiple columns with both numerical and categorical data. Columns such as Age have missing values, while others are complete. The target variable appears to be binary in nature.

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

The statistical summary shows the distribution of numerical features such as age and fare. There is a wide range of values, indicating variability in the dataset.

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Numerical Features

The following columns contain numerical values where mathematical operations are meaningful:

Age

Fare

SibSp

Parch

Categorical Features

These columns represent categories or text-based information:

Sex

Embarked

Ticket

Cabin

Name

Binary Feature

This column has only two possible values:

Survived (0 indicates not survived, 1 indicates survived)

Ordinal Feature

This column represents ordered categories:

Pclass (Passenger class: 1st, 2nd, and 3rd)

Observation

The dataset contains a combination of numerical, categorical, binary, and ordinal features. This variety of data types is suitable for machine learning tasks, but some preprocessing will be required before building predictive models.

In [8]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [9]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

The Sex column contains two categories: male and female. The Embarked column has three categories with one being more dominant, indicating imbalance.

The target variable in this dataset is Survived, which indicates whether a passenger lived or died. All remaining columns are treated as input features for machine learning models.

In [10]:
df.shape

(891, 12)

The dataset contains a sufficient number of records and features, making it suitable for basic machine learning tasks.

In [11]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

The Age and Cabin columns contain missing values, which may require preprocessing before modeling.